In [1]:
import pandas as pd
df=pd.read_csv('prod.csv')
df.shape

(7, 5)

In [2]:
df.dtypes

prod_id         object
prod_name       object
price          float64
launch_date     object
supplier_id     object
dtype: object

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   prod_id      7 non-null      object
 1   prod_name    7 non-null      object
 2   price        6 non-null      float64
 3   launch_date  7 non-null      object
 4   supplier_id  7 non-null      object
dtypes: float64(1), object(4)
memory usage: 412.0+ bytes

In [4]:
df.describe()

             price
count     6.000000
mean    495.833333
std     460.004529
min      25.000000
25%     112.500000
50%     450.000000
75%     750.000000
max    1200.000000

In [5]:
df.head()

  prod_id   prod_name   price launch_date supplier_id
0    P001      Laptop  1200.0  2022-03-15        S001
1    P002  Smartphone   800.0  2021-11-10        S002
2    P003      Tablet   600.0  2023-01-05        S001
3    P004     Monitor   300.0  2022-07-20        S003
4    P005     Printer     NaN  2022-09-12        S002

In [6]:
df.tail()

  prod_id prod_name  price launch_date supplier_id
2    P003    Tablet  600.0  2023-01-05        S001
3    P004   Monitor  300.0  2022-07-20        S003
4    P005   Printer    NaN  2022-09-12        S002
5    P006  Keyboard   50.0  2021-05-30        S003
6    P007     Mouse   25.0  2023-02-18        S001

In [7]:
df['price'].mean()

np.float64(495.8333333333333)

In [8]:
df['price'].isnull().sum()

np.int64(1)

In [9]:
df['price'].fillna(df['price'].mean(),inplace=True)

C:\Users\OM\AppData\Local\Temp\ipykernel_14924\3611970186.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['price'].fillna(df['price'].mean(),inplace=True)

In [10]:
df

  prod_id   prod_name        price launch_date supplier_id
0    P001      Laptop  1200.000000  2022-03-15        S001
1    P002  Smartphone   800.000000  2021-11-10        S002
2    P003      Tablet   600.000000  2023-01-05        S001
3    P004     Monitor   300.000000  2022-07-20        S003
4    P005     Printer   495.833333  2022-09-12        S002
5    P006    Keyboard    50.000000  2021-05-30        S003
6    P007       Mouse    25.000000  2023-02-18        S001

In [11]:
df.isnull().sum()

prod_id        0
prod_name      0
price          0
launch_date    0
supplier_id    0
dtype: int64

In [12]:
df['price'].dropna()

0    1200.000000
1     800.000000
2     600.000000
3     300.000000
4     495.833333
5      50.000000
6      25.000000
Name: price, dtype: float64

In [13]:
df.drop_duplicates()

  prod_id   prod_name        price launch_date supplier_id
0    P001      Laptop  1200.000000  2022-03-15        S001
1    P002  Smartphone   800.000000  2021-11-10        S002
2    P003      Tablet   600.000000  2023-01-05        S001
3    P004     Monitor   300.000000  2022-07-20        S003
4    P005     Printer   495.833333  2022-09-12        S002
5    P006    Keyboard    50.000000  2021-05-30        S003
6    P007       Mouse    25.000000  2023-02-18        S001

In [15]:
df['launch_date']=pd.to_datetime(df['launch_date'])

In [16]:
df.dtypes

prod_id                object
prod_name              object
price                 float64
launch_date    datetime64[ns]
supplier_id            object
dtype: object

In [17]:
# Select all products with price greater than 1000
price_above_1k = df[df['price'] > 1000]
price_above_1k

  prod_id prod_name   price launch_date supplier_id
0    P001    Laptop  1200.0  2022-03-15        S001

In [19]:
# Filter products launched after 2022-01-01
df['launch_date'] = pd.to_datetime(df['launch_date'])
products_after_2022 = df[df['launch_date'] > '2022-01-01']
products_after_2022

  prod_id prod_name        price launch_date supplier_id
0    P001    Laptop  1200.000000  2022-03-15        S001
2    P003    Tablet   600.000000  2023-01-05        S001
3    P004   Monitor   300.000000  2022-07-20        S003
4    P005   Printer   495.833333  2022-09-12        S002
6    P007     Mouse    25.000000  2023-02-18        S001